#Использовать tempfiles
#Использовать v8storage
#Использовать v8runner
#Использовать json

Перем чслПоследняяПолученнаяВерсияХранилища;



//Можно написать как свое получение версий, так и воспользоваться сервисом от Вити
Функция ПолучитьТаблицуВерсий(чслПоследняяПолученнаяВерсияХранилища)
	менХК = Новый МенеджерХранилищаКонфигурации();
	менХК.УстановитьПутьКХранилищу("C:/rep_CBD/wh_CDB");
	менХК.УстановитьПараметрыАвторизации("deploy","1");
	менХК.ПрочитатьХранилище(чслПоследняяПолученнаяВерсияХранилища);

	Возврат менХК.ПолучитьТаблицуВерсий();
КонецФункции

Функция РаспарситьКомментарий(тзКомментариев)
	тзКомментариев.Колонки.Добавить("Задача");
	тзКомментариев.Колонки.Добавить("ЕстьЗадача");
	тзКомментариев.Колонки.Добавить("ЕстьРеструктуризация");
	
	Для Каждого элТз Из тзКомментариев Цикл
		сткЗадача = ПопробоватьНайтиНомерИЛИСсылкуЗадачи(тзКомментариев.Комментарий);
		ЗаполнитьЗначенияСвойств(элТз, сткЗадача)	
	КонецЦикла;

	Возврат тзКомментариев;
КонецФункции

Функция ПопробоватьНайтиНомерИЛИСсылкуЗадачи(стрКомментарийКПомещению)
	сткЗадача = Новый Структура("ЕстьЗадача, Задача", Ложь, "");
	Если СтрНайти(стрКомментарийКПомещению, "Задача?ref") Тогда
		сткЗадача.ЕстьЗадача = Истина;
		сткЗадача.Задача = НайтиСсылку("Задача?ref", стрКомментарийКПомещению);	
	ИначеЕсли СтрНайти(стрКомментарийКПомещению, "ЗаявкаНаРазработку?ref") Тогда
		сткЗадача.ЕстьЗадача = Истина;
		сткЗадача.Задача = НайтиСсылку("ЗаявкаНаРазработку?ref", стрКомментарийКПомещению);
	ИначеЕсли СтрНайти(стрКомментарийКПомещению, "sdms-task:") Тогда
		сткЗадача.ЕстьЗадача = Истина;
		сткЗадача.Задача = НайтиНомер("sdms-task:", стрКомментарийКПомещению);
	ИначеЕсли СтрНайти(стрКомментарийКПомещению, "З0") Тогда
		сткЗадача.ЕстьЗадача = Истина;
		сткЗадача.Задача = НайтиНомер("З0", стрКомментарийКПомещению);
	КонецЕсли;

	Возврат сткЗадача;
КонецФункции

Функция НайтиСсылку(стрСлово, стрСтрокаДляПоиска)

КонецФункции

Функция НайтиНомер(стрСлово, стрСтрокаДляПоиска)

КонецФункции

чслПоследняяПолученнаяВерсияХранилища = 1;
тзКомментариев = ПолучитьТаблицуВерсий(чслПоследняяПолученнаяВерсияХранилища);
тзКоммПоЗадачам = РаспарситьКомментарий(тзКомментариев);

