#Использовать tempfiles
#Использовать v8storage
#Использовать v8runner
#Использовать json


ttt = 3;

Если ttt = 3 Тогда
	Сообщить("точно 3");
КонецЕсли;

ХК = Новый МенеджерХранилищаКонфигурации();
ХК.УстановитьПутьКХранилищу("C:/rep_CBD/wh_CDB");
ХК.УстановитьПараметрыАвторизации("deploy","1");
ХК.ПрочитатьХранилище();

тз = ХК.ПолучитьТаблицуВерсий();
Для Каждого элТз из тз Цикл
	Сообщить(СтрШаблон("номер %1 дата %2 Автор %3 Комментарий %4",элТз.Номер,элТз.Дата,элТз.Автор,элТз.Комментарий));
КонецЦикла;

ПутьКФайлуОтчета = ВременныеФайлы.НовоеИмяФайла("mxl");
ПутьКФайлуОтчетаJSON = ВременныеФайлы.НовоеИмяФайла("json");

ХК.ПолучитьОтчетПоВерсиям(ПутьКФайлуОтчета, "1");
ХК.СконвертироватьОтчет(ПутьКФайлуОтчета, ПутьКФайлуОтчетаJSON);
Сообщить(ПутьКФайлуОтчетаJSON);